<?php
	$db_hostname = 'localhost';
	$db_database = '****';
	$dsn = "mysql:host=$db_hostname;dbname=$db_database;charset=utf8";
	$opt = array(
		PDO::ATTR_ERRMODE 			 => PDO::ERRMODE_EXCEPTION,
		PDO::ATTR_DEFAULT_FETCH_MODE => PDO::FETCH_ASSOC
		);
    $pdo = new PDO($dsn, '****', '****', $opt);
	$x = $_GET['i'];
	$map1 = array();
	$map2 = array();
	$i = 0;
	$stmt = $pdo->query('SELECT * FROM localities');
	while($row = $stmt->fetch())
		$map1[]= $row['name'];
	$stmt = $pdo->query('SELECT * FROM streets');
	while($row = $stmt->fetch())
		$map2[] = $row['name'];
	$male1 = array('Петров','Сидоров','Пушкин','Лермонтов','Лукъянов','Королев','Гагарин','Москвин','Козлов','Иванов','Брушкевич','Устинов','Киргинцев','Задорнов','Гаврилов','Сергеев','Юсупов','Карелин','Митрофанов','Земцов','Проскурин');
	$male2 = array('Иван','Денис','Александр','Кирилл','Роман','Петр','Богдан','Алексей','Дмитрий','Гавриил','Вадим','Максим','Антон','Сергей','Владислав','Станислав','Михаил','Юрий','Марат','Давид','Леонид');
	$male3 = array('Иванович','Денисович','Александрович','Кириллович','Романович','Петрович','Богданович','Алексеевич','Дмитриевич','Гавриилович','Вадимович','Максимович','Антонович','Сергеевич','Владиславович','Станиславович','Михайлович','Юриевич','Маратович','Давидович','Леонидович');
	$female1 = array('Петрова','Сидорова','Пушкина','Лермонтова','Лукъянова','Королева','Гагарина','Москвина','Козлова','Иванова','Брушкевич','Устинова','Киргинцева','Задорнова','Гаврилова','Сергеева','Юсупова','Карелина','Митрофанова','Земцова','Проскурина');
	$female2 = array('Марина','Алина','Екатерина','Виктория','Юлия','Диана','Галина','Надежда','Вера','Любовь','Вероника','Карина','Алена','Олеся','Марьяна','Мирослава','Анастасия','Анфиса','Полина','Евгения','Елена','Есения','Ксения','Маргарита','Ольга','Наталья','Светлана');
	$female3 = array('Ивановна','Денисовна','Александровна','Кирилловна','Романовна','Петровна','Богдановна','Алексеевна','Дмитриевна','Гаврииловна','Вадимовна','Максимовна','Антоновна','Сергеевна','Владиславовна','Станиславовна','Михайловна','Юриевна','Маратовна','Давидовна','Леонидовна');
	if ($x < 100) 
	{
		//$arr = array();
		for ($i = $x*100+1; $i <= ($x+1)*100; $i++){
			$p = rand(0,5);
			/*if ($p > 0){
				$name = $male1[rand(0,(count($male1)-1))].' '.$male2[rand(0,(count($male2)-1))].' '.$male3[rand(0,(count($male3)-1))];
			}
			else{
				$name = $female1[rand(0,(count($female1)-1))].' '.$female2[rand(0,(count($female2)-1))].' '.$female3[rand(0,(count($female3)-1))];
			}
			$m = rand(1,12);
			if ($m == 2)
				$d = rand(1,28);
			else if ($m%2 == 0)
				$d = rand(1,30);
			else $d = rand(1,30);
			$date = rand(1960,1995).'/'.$m.'/'.$d;
			//*/
			/*$addr = $map1[rand(0,(count($map1)-1))].', ул. '.$map2[rand(0,(count($map2)-1))].', д. '.rand(1,200).', кв. '.rand(1,300);
			$arr[]=array(
				'name' => $name,
				'bdate' => $date,
				'addr' => $addr
			);*/
			for($j=0; $j<$p; $j++)
			{
				$phone = '89'.rand(100000000,999999999);
				$stmt = $pdo->prepare('INSERT INTO `phones`( abonid, number) VALUES (?,?)');
				$stmt->execute(array($i,$phone));
			}
		}
		echo "<script language='javascript'>\n";
		echo '  location.href="http://127.0.0.1/edsa-NES/tempinsert.php?i='.($x+1).'"';
		echo "</script>\n";
		exit();
	}
	else echo 'success!';
?>